[
  {
    "name": "Hummingbird Cupcakes Recipe | Zarnak Sidhwa | Masala TV",
    "ingredients": "Ingredients for Hummingbird Cupcakes Recipe: Flour 3 cups Baking soda 1 tsp Salt 1 tsp Sugar 2 cups Ground cinnamon 1 tsp Eggs (beaten) 3 Oil 1 cup Vanilla essence 1-1/2 tsp Crushed pineapple (undrained) 1 can (8 oz) Chopped walnuts 1 cup Chopped bananas 2 cups Cream cheese 8 oz Vanilla essence 1 tsp Unsalted butter 4 oz Icing sugar (sifted) 2 cups Chopped walnuts (to decorate) 1/2 cup",
    "instructions": "Combine first 5 ingredients in a large bowl; add eggs and oil, stirring until dry ingredients are moistened. (Do not beat.) Stir in vanilla, pineapple, 1 cup walnuts, and bananas. Pour batter into lined cupcakes tray. Bake at 180 degrees C for 15 to 20 minutes or until a wooden pick inserted in center comes out clean. Cool in pans on wire racks 10 minutes; remove from pans, and cool completely on wire racks. For the frosting, beat the cream cheese and butter well and then add gradually the sifted icing sugar till stiff. Add in the vanilla essence as well. Let chill until using. Pipe cream cheese frosting on the cupcakes; garnish with pineapple chunks and walnut halves and store in a refrigerator before serving.",
    "prepTime": 45,
    "cookTime": 60,
    "totalTime": 105,
    "recipeYield": "3-4",
    "calories": 150,
    "youtube_link": "https://youtu.be/",
    "category": "Deserts",
    "matched_ingredients_v4": {
      "sugar": {
        "ingredient_text": "icing sugar (sifted) 2",
        "qty": 2.0,
        "unit": "unit",
        "grams": 200.0,
        "price_low": 178.0,
        "price_avg": 178.0,
        "price_high": 178.0,
        "cost_range": [
          35.6,
          35.6
        ],
        "cost_contrib_avg": 35.6
      },
      "egg": {
        "ingredient_text": "eggs (beaten) 3",
        "qty": 3.0,
        "unit": "unit",
        "grams": 300.0,
        "price_low": 280.0,
        "price_avg": 304.5,
        "price_high": 329.0,
        "cost_range": [
          84.0,
          98.7
        ],
        "cost_contrib_avg": 91.35
      },
      "rai": {
        "ingredient_text": "crushed pineapple (undrained) 1",
        "qty": 1.0,
        "unit": "unit",
        "grams": 100.0,
        "price_low": 805.0,
        "price_avg": 805.0,
        "price_high": 805.0,
        "cost_range": [
          80.5,
          80.5
        ],
        "cost_contrib_avg": 80.5
      }
    },
    "estimated_cost_v4": {
      "min": 235.7,
      "avg": 243.05,
      "max": 250.4
    }
  }
]