[
  {
    "name": "Chocolate Fudge Cupcakes Recipe | Shireen Anwar | Masala TV",
    "ingredients": "Ingredients for Chocolate Fudge Cupcakes Recipe: for cup cakes: Flour 1 cup Cocoa Powder half cup Baking Powder 1 tsp Salt ¼ tsp Caster Sugar 1 cup Oil half cup Vanilla Essence 1 tsp Eggs 3 Chocolate (chopped) Half cup Chocolate fudge frosting: Chocolate chopped 150 grams Butter softened 100 grams Icing sugar 6 oz Vanilla essence 1 tsp Silver balls for decoration",
    "instructions": "Pre-heat oven to 180 Degrees, Line muffin pan with paper liners, beat oil ad sugar for 2 mins, add vanilla. Add eggs once at a time beating well after each addition, add flour mixture, and mix until combined. Add chopped chocolate mix lightly with spatula, scoop batter into prepared pan bake for 20 mins until done. Cool for 10 mins, remove from pan cool completely. For frosting: Melt chocolate in a double boiler stir well to make it smooth, beat together butter icing sugar and vanilla until smooth and fluffy. Add melted chocolate beat on low speed till mixed. Now beat on high speed till smooth and glossy. Put it in a piping bag, pipe over the cool cup cakes. Decorate with silver balls.",
    "prepTime": 45,
    "cookTime": 60,
    "totalTime": 105,
    "recipeYield": "6",
    "calories": 150,
    "youtube_link": "https://youtu.be/",
    "category": "Deserts",
    "matched_ingredients_v4": {
      "sugar": {
        "ingredient_text": "icing sugar 6",
        "qty": 6.0,
        "unit": "unit",
        "grams": 600.0,
        "price_low": 178.0,
        "price_avg": 178.0,
        "price_high": 178.0,
        "cost_range": [
          106.8,
          106.8
        ],
        "cost_contrib_avg": 106.8
      },
      "egg": {
        "ingredient_text": "eggs 3",
        "qty": 3.0,
        "unit": "unit",
        "grams": 300.0,
        "price_low": 280.0,
        "price_avg": 304.5,
        "price_high": 329.0,
        "cost_range": [
          84.0,
          98.7
        ],
        "cost_contrib_avg": 91.35
      }
    },
    "estimated_cost_v4": {
      "min": 208.6,
      "avg": 215.95,
      "max": 223.3
    }
  }
]