[
  {
    "name": "Crunchy Burger Recipe | Gulzar Hussain | Masala TV",
    "ingredients": "Ingredients for Crunchy Burger Recipe: Chicken Breast 1 Eggs 2-3 Buns 3-4 White Flour ½ cup Rice Flour 1 cup Corn Flour 1 cup Baking Powder 1/3 tsp Garlic Powder 1 tsp Red Chili Powder 1 tsp Black Pepper 1 tbsp White Pepper Powder 1 tbsp Mustard Paste 2-3 tbsp Chicken Powder 2 tbsp White Vinegar 3 tbsp Oil for frying Ice Burg as required Mayonnaise as required Salt to taste",
    "instructions": "Take a 1 chicken breast pieces cut into 6slices oiling on it and add it the plastic bag then flatten with kitchen hammer and add it to the mixing bowl then add 2 tbsp o white vinegar, to taste salt, 2-3 tbsp of mustard paste , 1 tsp of red chili powder, 1 tsp of garlic powder, mix it well and marinade the chicken slices for ½ an hour. Take a jar add ½ cup white flour, 1 cup of rice flour, 1 cup of corn flour, 2 tbsp of chicken powder, 1 tbsp of black pepper powder, 1 tbsp of white pepper powder, 1 tsp of garlic powder and add to taste salt mix it well. Take 1 bowl add 2-3 eggs beat it then dip the marinade chicken slices into eggs then coat it the dry mixture then dip into eggs and then again add into dry mixture repeat this procedure at least two times and take a fry pan heat the on it and fry the chicken pieces. Take 1 bowl add as required mayonnaise and 2-3 tbsp of mustard paste mix it well. Take 3-4 buns spread the sauce place the fried chicken piece the again spread the sauce and place it ice burg or lettuce leaves. At last close it with the top of bun and serve it.",
    "prepTime": 30.0,
    "cookTime": 45,
    "totalTime": 75,
    "recipeYield": "",
    "calories": 150,
    "youtube_link": "https://youtu.be/",
    "category": "Fast-Food",
    "matched_ingredients_v4": {
      "chicken": {
        "ingredient_text": "chicken",
        "qty": 1.0,
        "unit": "unit",
        "grams": 100.0,
        "price_low": 595.0,
        "price_avg": 722.5,
        "price_high": 850.0,
        "cost_range": [
          59.5,
          85.0
        ],
        "cost_contrib_avg": 72.25
      },
      "egg": {
        "ingredient_text": "eggs 2",
        "qty": 2.0,
        "unit": "unit",
        "grams": 200.0,
        "price_low": 280.0,
        "price_avg": 304.5,
        "price_high": 329.0,
        "cost_range": [
          56.0,
          65.8
        ],
        "cost_contrib_avg": 60.9
      },
      "garlic": {
        "ingredient_text": "garlic",
        "qty": 1.0,
        "unit": "unit",
        "grams": 100.0,
        "price_low": 390.0,
        "price_avg": 472.5,
        "price_high": 555.0,
        "cost_range": [
          39.0,
          55.5
        ],
        "cost_contrib_avg": 47.25
      }
    },
    "estimated_cost_v4": {
      "min": 214.0,
      "avg": 252.65,
      "max": 291.3
    }
  }
]