[
  {
    "name": "Punjabi Yakhni Pulao Recipe | Masala TV",
    "ingredients": "Ingredients for Punjabi Yakhni Pulao Recipe: Ingredients for Masala Salt 1 tbsp Coriander seeds 3 tbsp Cloves 6 to 8 Button red chilies 12 to 15 Black pepper whole 10 to 20 Ginger powder 1 tsp Cinnamon 2 sticks Garlic powder 1 tsp Citric acid 1 tsp Black cardamom 2 Green cardamom 4 to 6 White cumin seeds 1 tbsp Bay leaf chopped 2 Dried papaya powder 1 tbsp All spice powder 1 tbsp Ingredients for Yakhni Pulao Mutton 750 gm Rice 750 gm Onions 3 sliced Ginger garlic 2 tbsp Oil 1 cup Yogurt 1 cup Green chili garlic sauce 2 tbsp",
    "instructions": "METHOD FOR MASALA Mix all the ingredients in a bowl, fill in a airtight jar, use as required METHOD FOR PULAO In a pan add 7 cups water, mutton, ginger garlic paste, 4 tbsp pulao masala Cover and boil on low heat till mutton tender Then remove the mutton from stock, measure stock and make up to 6 cups, sieve the stock, discard the spices. Heat oil, fry onion golden, add boil mutton, green chili garlic sauce with stock Add salt 1 tbsp, bring to boil, add in soaked rice, cover and cook till rice done Leave it on dum, serve with raita.",
    "prepTime": 15.0,
    "cookTime": 25,
    "totalTime": 40,
    "recipeYield": "4",
    "calories": 150,
    "youtube_link": "https://youtu.be/",
    "category": "main course",
    "matched_ingredients_v4": {
      "mutton": {
        "ingredient_text": "mutton 7",
        "qty": 7.0,
        "unit": "unit",
        "grams": 700.0,
        "price_low": 1600.0,
        "price_avg": 1800.0,
        "price_high": 2000.0,
        "cost_range": [
          1120.0,
          1400.0
        ],
        "cost_contrib_avg": 1260.0
      },
      "onion": {
        "ingredient_text": "onions 3",
        "qty": 3.0,
        "unit": "unit",
        "grams": 300.0,
        "price_low": 190.0,
        "price_avg": 215.0,
        "price_high": 240.0,
        "cost_range": [
          57.0,
          72.0
        ],
        "cost_contrib_avg": 64.5
      },
      "garlic": {
        "ingredient_text": "green chili garlic sauce 2",
        "qty": 2.0,
        "unit": "unit",
        "grams": 200.0,
        "price_low": 390.0,
        "price_avg": 472.5,
        "price_high": 555.0,
        "cost_range": [
          78.0,
          111.0
        ],
        "cost_contrib_avg": 94.5
      }
    },
    "estimated_cost_v4": {
      "min": 1333.0,
      "avg": 1513.5,
      "max": 1694.0
    }
  }
]